Revit 2027 API
UIControlledApplication.ControlledApplication Property
Returns the database level ControlledApplication represented by this UI-level ControlledApplication.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ControlledApplication ControlledApplication { get; }
Public ReadOnly Property ControlledApplication As ControlledApplication
	Get
public:
property ControlledApplication^ ControlledApplication {
	ControlledApplication^ get ();
}
member ControlledApplication : ControlledApplication with get
Property Value
ControlledApplication
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace